tutorials/cfdemSolverPiso/voidfractionTest/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cfdemSolverPiso;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

maxDeltaT       1;

functions
{
    probes
    {
        type        probes;
        functionObjectLibs ( "libsampling.so" );  
        // directory for probe data
        name        probes;
        probeLocations
        (
            (0.05001 0.05001 0.5)
        );

        // fields to be probed
        fields ( volAverage_ddtVoidfraction voidfraction );

        // write at same frequency as fields
        writeControl   timeStep;//outputTime;
        writeInterval  1;
    }
}

// ************************************************************************* //
